chap1/ex1.20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-06 Sun 18:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Moore" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org486c6e1">Exercise 1.20</a>
<ul>
<li><a href="#org6fc7bae">Normal order</a></li>
<li><a href="#orgd45f79f">Applicative Order</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org486c6e1" class="outline-2">
<h2 id="org486c6e1">Exercise 1.20</h2>
<div class="outline-text-2" id="text-org486c6e1">
<p>
The rendered HTML for this file can be viewed at 
<a href="http://htmlpreview.github.io/?https://github.com/jonmoore/sicp/blob/master/chap1/ex1.20.html">http://htmlpreview.github.io/?https://github.com/jonmoore/sicp/blob/master/chap1/ex1.20.html</a>
</p>
</div>

<div id="outline-container-org6fc7bae" class="outline-3">
<h3 id="org6fc7bae">Normal order</h3>
<div class="outline-text-3" id="text-org6fc7bae">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #32cd32;">define</span> (<span style="color: #cd5c5c; background-color: #00008b;">gcd</span> a b)
  (<span style="color: #32cd32;">if</span> (= b 0)
      a
      (gcd b (remainder a b))))
</pre>
</div>

<p>
Assume that the evaluation requires <code>n</code> calls to <code>gcd</code>.  After
expansion, the callstack looks like
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #32cd32;">if</span> (= b_1 0)
    a_1
    (<span style="color: #32cd32;">if</span> (= b_2 0)
        a_2
        (<span style="color: #32cd32;">if</span> (= b_3 0)
            <span style="color: #87ceeb;">;; </span><span style="color: #87ceeb;">...</span>
            (<span style="color: #32cd32;">if</span> (= b_n 0)
                a_n
                (gcd b_n (remainder a_n b_n)))
                <span style="color: #87ceeb;">;; </span><span style="color: #87ceeb;">...</span>
                )))
</pre>
</div>
<p>
where \(a_i\) and \(b_i\) are the arguments to the ith call to <code>gcd</code>. We
can simplify this by dropping unevaluated terms and replacing \(a_{n}\)
by \(b_{n-1}\), taking \(b_0 = a_1\).
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #32cd32;">if</span> (= b_1 0)
    (<span style="color: #32cd32;">if</span> (= b_2 0)
        (<span style="color: #32cd32;">if</span> (= b_3 0)
            <span style="color: #87ceeb;">;; </span><span style="color: #87ceeb;">...</span>
            (<span style="color: #32cd32;">if</span> (= b_n 0)
                b_{n-1} <span style="color: #87ceeb;">;; </span><span style="color: #87ceeb;">a_n </span>
                <span style="color: #87ceeb;">;; </span><span style="color: #87ceeb;">...</span>
                )))
</pre>
</div>

<p>
The following is useful in summing Fibonacci-like sequences:
</p>
<ul class="org-ul">
<li>If a sequence \(G\) obeys \(G_{n+1}=G_{n}+G_{n-1}\), i.e. the Fibonacci
recursion, then it's the solution of a second-order difference
equation with a two-dimensional solution space spanned by any two
independent solutions, so can assume \(G_n = \alpha F_n + \beta
  F_{n-1}\), hence \(G_1 = \alpha, G_2 = \alpha + \beta\), hence \(\alpha
  = G_1, \beta = G_2 - G_1\), hence \(G_n = G_1 F_n + (G_2-G_1)
  F_{n-1}\).</li>
<li>If a sequence \(H\) obeys \(H_{n+1}=H_{n}+H_{n-1}+\gamma\) then
\(H_{n}+\gamma\) obeys the Fibonacci recursion and \(H_{n} = (H_1
  +\gamma) F_n + (H_{2}-H_{1})F_{n-1} - \gamma\).</li>
</ul>

<p>
Let the number of calls to <code>remainder</code> present in \(b_n\) be \(x_n\).
Then \(x_{n+2} = x_{n+1} + x_n + 1\) and \(x_{1}=0, x_{2}=1\) so by the
above \(x_n= F_{n}+F_{n-1}-1 = F_{n+1}-1\), and the number of calls to
<code>remainder</code> is
</p>
<ul class="org-ul">
<li>\(\sum_{i=1}^{n}{x_{i}}+x_{n-1}\)</li>
<li>(\(\sum_{i=1}^{n}{F_{i+1}}) -n+ F_{n}-1\)</li>
<li>\(S_{n+1}-F_{n}-n-2\), where \(S\) is the cumulative sum of Fibonacci numbers, \(S_{n}=\sum_{i=0}^{n}{F_i}\).</li>
</ul>

<p>
We can express \(S\) in terms of \(F\): from expanding the \(F_{i}\) terms,
\(S_{n+1} = S_{n}+S_{n-1}+1\) and we have \(S_{1}=1\), \(S_{2}=2\), so
from the above \(S_{n}=2F_{n}+F_{n-1}-1\) <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. Using this yields
\(S_{n+1}+F_{n}=2F_{n+1}+2F_{n}-1=2F_{n+2}-1\).
</p>

<p>
The number of calls to <code>remainder</code> is thus \(2F_{n+2}-n-3\)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">n</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">\(F_n\)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">5</td>
<td class="org-right">8</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-left">\(x_{n}\)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">7</td>
<td class="org-right">11</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">\(2F_{n+2}\)</td>
<td class="org-right">4</td>
<td class="org-right">6</td>
<td class="org-right">10</td>
<td class="org-right">16</td>
<td class="org-right">26</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">\(n+3\)</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">calls</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
<td class="org-right">9</td>
<td class="org-right">18</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
For the example in the text,
</p>
<pre class="example">
GCD(206,40) = GCD(40,6)
            = GCD(6,4)
            = GCD(4,2)
            = GCD(2,0) = 2
</pre>
<p>
we take \(n=5\) since 5 calls to <code>gcd</code> are needed, hence the number of
calls to <code>remainder</code> is 18.
</p>
</div>
</div>

<div id="outline-container-orgd45f79f" class="outline-3">
<h3 id="orgd45f79f">Applicative Order</h3>
<div class="outline-text-3" id="text-orgd45f79f">
<p>
For the example, evaluation using applicative order will make 4 calls
to <code>remainder</code> since it will make one call each time <code>gcd</code> is called
after the first.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
For use on its own, \(S_{n}\) can be rewritten to \(F_{n+2}-1\).
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Moore</p>
<p class="date">Created: 2018-05-06 Sun 18:39</p>
<p class="validation"></p>
</div>
</body>
</html>
